## Data Manipulation

In [31]:
import pandas as pd
print("Hello")

Hello

In [32]:
data = {
    'name': ['kaushal','rohan','omkar'],
    'age' : [21,34,55],
    'city' : ['mumbai','pune','delhi']
}
Dataframe = pd.DataFrame(data)
print(Dataframe)

      name  age    city
0  kaushal   21  mumbai
1    rohan   34    pune
2    omkar   55   delhi

#### Adding an column to Dataframe

In [33]:
Dataframe['salary']=[40000,50000,60000]
print(Dataframe)
Dataframe

      name  age    city  salary
0  kaushal   21  mumbai   40000
1    rohan   34    pune   50000
2    omkar   55   delhi   60000

      name  age    city  salary
0  kaushal   21  mumbai   40000
1    rohan   34    pune   50000
2    omkar   55   delhi   60000

#### Removing Rows

In [34]:
Dataframe.drop(1,inplace=True)

In [35]:
Dataframe

      name  age    city  salary
0  kaushal   21  mumbai   40000
2    omkar   55   delhi   60000

#### Removing Column

In [36]:
# The Below drop method will used to find the "city" in the rows....as drop function leads to drop rows default
# Dataframe.drop('city')

# So we need to mention an axis=1 so it will take 'city' as column
# Dataframe.drop('city',axis=1)

# If you drop the colum it will not delete the column permanantly by above method so we will do 'inplace= True' as below
Dataframe.drop('city',axis=1,inplace=True)         # Deleted Permanantly

In [37]:
Dataframe

      name  age  salary
0  kaushal   21   40000
2    omkar   55   60000

#### Updating Values in Columns

In [38]:
Dataframe

      name  age  salary
0  kaushal   21   40000
2    omkar   55   60000

In [39]:
Dataframe['age']=Dataframe['age']+5    # Added 5 to each age

In [40]:
Dataframe

      name  age  salary
0  kaushal   26   40000
2    omkar   60   60000